In [6]:
import pandas as pd
import numpy as np
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [7]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [8]:
sozluk

{'var1': array([4, 5, 5, 9, 6]),
 'var2': array([1, 5, 9, 7, 1]),
 'var3': array([2, 5, 9, 3, 0])}

In [9]:
df=pd.DataFrame(sozluk)

In [10]:
df

   var1  var2  var3
0     4     1     2
1     5     5     5
2     5     9     9
3     9     7     3
4     6     1     0

In [11]:
df[0:1]

   var1  var2  var3
0     4     1     2

In [12]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df.index=["a","b","c","d","e"]
df

   var1  var2  var3
a     4     1     2
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [14]:
df["c":"e"]

   var1  var2  var3
c     5     9     9
d     9     7     3
e     6     1     0

In [15]:
#silme işlemleri için ise

In [16]:
df.drop("a",axis=0)#a yı satırdan sildik tamamen,silerken index olarak da seçim yaptık ayrıca.Ama kalıcı olarak silme yapmadık

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [17]:
df

   var1  var2  var3
a     4     1     2
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [19]:
df.drop("a", axis=0 , inplace=True)#kalıcı olaak silme işelmi yaptık

In [20]:
df

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [21]:
#fancy ile tek tek degilde birden fazla satırı silme yapabiliriz

In [22]:
l=["c","e"]

In [23]:
df.drop(l,axis=0)

   var1  var2  var3
b     5     5     5
d     9     7     3

In [24]:
df

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [25]:
#degişkenler için  silme için ise

In [26]:
"var1" in df

True

In [27]:
l=["var1","var4","var2"]

In [28]:
for i in l:
    print(i in df)

True
False
True

In [29]:
df

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [31]:
df["var4"]=df["var1"]/df["var2"]

In [32]:
df

   var1  var2  var3      var4
b     5     5     5  1.000000
c     5     9     9  0.555556
d     9     7     3  1.285714
e     6     1     0  6.000000

In [33]:
#degişken silmek

In [34]:
df.drop("var4",axis=1)

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [35]:
df

   var1  var2  var3      var4
b     5     5     5  1.000000
c     5     9     9  0.555556
d     9     7     3  1.285714
e     6     1     0  6.000000

In [36]:
df.drop("var4",axis=1,inplace=True)#kalıcı olarak silme işlemi yaptık

In [37]:
df

   var1  var2  var3
b     5     5     5
c     5     9     9
d     9     7     3
e     6     1     0

In [38]:
l=["var1","var2"]

In [39]:
df.drop(l,axis=1)#degişkenlerin ismini yazmandan birden fazla elemanın silme işlemini yapmış olduk

   var3
b     5
c     9
d     3
e     0